In [1]:
import sys
print(sys.version)
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

3.5.2 |Anaconda 4.2.0 (64-bit)| (default, Jul  5 2016, 11:41:13) [MSC v.1900 64 bit (AMD64)]

In [2]:
df = pd.read_csv('../Baridhara.csv')
df.head()

C:\Program Files\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2717: DtypeWarning: Columns (6) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,SL,NAME,ACCOUNT_NO,METER_NO,ADDRESS,ZONE,BLOCK,ROUTE,LOAD,TARIFF,METER_STATUS,MONTH,YEAR,UNIT
0,40208,MD SHA ALAM,20000032,299778,"House/Flat # 1042, KHIL BARIRTEK",JB,279,182.0,2,A,Single,10,2012,442
1,718500,MD SHA ALAM,20000032,299778,"House/Flat # 1042, KHIL BARIRTEK",JB,279,182.0,2,A,Single,11,2012,199
2,725258,MD SHA ALAM,20000032,299778,"House/Flat # 1042, KHIL BARIRTEK",JB,279,182.0,2,A,Single,12,2012,140
3,726762,MD SHA ALAM,20000032,299778,"House/Flat # 1042, KHIL BARIRTEK",JB,279,182.0,2,A,Single,1,2013,101
4,754919,MD SHA ALAM,20000032,299778,"House/Flat # 1042, KHIL BARIRTEK",JB,279,182.0,2,A,Single,2,2013,95

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1387888 entries, 0 to 1387887
Data columns (total 14 columns):
SL              1387888 non-null int64
NAME            1387888 non-null object
ACCOUNT_NO      1387888 non-null int64
METER_NO        1382344 non-null object
ADDRESS         1387832 non-null object
ZONE            1387888 non-null object
BLOCK           1387888 non-null object
ROUTE           1387888 non-null float64
LOAD            1387888 non-null int64
TARIFF          1387888 non-null object
METER_STATUS    1387888 non-null object
MONTH           1387888 non-null int64
YEAR            1387888 non-null int64
UNIT            1387888 non-null int64
dtypes: float64(1), int64(6), object(7)
memory usage: 148.2+ MB

In [4]:
df.isnull().sum()

SL                 0
NAME               0
ACCOUNT_NO         0
METER_NO        5544
ADDRESS           56
ZONE               0
BLOCK              0
ROUTE              0
LOAD               0
TARIFF             0
METER_STATUS       0
MONTH              0
YEAR               0
UNIT               0
dtype: int64

In [5]:
df = df.dropna()
df.isnull().sum()

SL              0
NAME            0
ACCOUNT_NO      0
METER_NO        0
ADDRESS         0
ZONE            0
BLOCK           0
ROUTE           0
LOAD            0
TARIFF          0
METER_STATUS    0
MONTH           0
YEAR            0
UNIT            0
dtype: int64

In [6]:
df.to_csv('../Baridhara.csv',index=False)
df.tail()

,SL,NAME,ACCOUNT_NO,METER_NO,ADDRESS,ZONE,BLOCK,ROUTE,LOAD,TARIFF,METER_STATUS,MONTH,YEAR,UNIT
1387883,561556,MRS.MAJIRUN NESA,33027320,297545,"DAG-1183, NURER CHALA",JB,1100,1190.0,3,A,Single,6,2011,737
1387884,572633,MRS.MAJIRUN NESA,33027320,297545,"DAG-1183, NURER CHALA",JB,1100,1190.0,3,A,Single,7,2011,850
1387885,580786,MRS.MAJIRUN NESA,33027320,297545,"DAG-1183, NURER CHALA",JB,1100,1190.0,3,A,Single,8,2011,951
1387886,590974,MRS.MAJIRUN NESA,33027320,297545,"DAG-1183, NURER CHALA",JB,1100,1190.0,3,A,Single,9,2011,951
1387887,596530,MRS.MAJIRUN NESA,33027320,297545,"DAG-1183, NURER CHALA",JB,1100,1190.0,3,A,Single,10,2011,896

In [7]:
neg_unit_rows = df.loc[df['UNIT'] <0]

In [8]:
neg_unit_rows.head()

,SL,NAME,ACCOUNT_NO,METER_NO,ADDRESS,ZONE,BLOCK,ROUTE,LOAD,TARIFF,METER_STATUS,MONTH,YEAR,UNIT
1522,707658,Md. Joynal Abedin,20000243,023729,"House/Flat # 1097/1100VATARA, KHILBARIRTAK, Co...",JB,1065,548.8,2,A,check,9,2012,-283
2233,399863,MS.DELOARA BEGUM,20000280,11215221,"House/Flat # 1183,, NURER CHALA, Contact no: 0...",JB,290,2510.0,2,A,check,10,2012,-507
2235,711749,MS.DELOARA BEGUM,20000280,11215221,"House/Flat # 1183,, NURER CHALA, Contact no: 0...",JB,290,2510.0,2,A,check,11,2012,-90
2236,723154,MS.DELOARA BEGUM,20000280,11215221,"House/Flat # 1183,, NURER CHALA, Contact no: 0...",JB,290,2510.0,2,A,check,12,2012,-34
2237,733584,MS.DELOARA BEGUM,20000280,11215221,"House/Flat # 1183,, NURER CHALA, Contact no: 0...",JB,290,2510.0,2,A,check,1,2013,-33

In [9]:
neg_unit_rows.count()

SL              4846
NAME            4846
ACCOUNT_NO      4846
METER_NO        4846
ADDRESS         4846
ZONE            4846
BLOCK           4846
ROUTE           4846
LOAD            4846
TARIFF          4846
METER_STATUS    4846
MONTH           4846
YEAR            4846
UNIT            4846
dtype: int64

In [10]:
def IMPUTE_UNIT(x):
    if x.UNIT < 0:
        return 0
    else:
        return x.UNIT
def mean_calculate(acc, year):
    return "(ACCOUNT_NO =="+ str(acc)+") & (YEAR =="+str(year)+") & (UNIT > 0)"

def IMPUTE_UNIT_WITH_MEAN(x):
    if x.UNIT < 0:
        acc = x.ACCOUNT_NO
        year = x.YEAR
        mean = 0
        mean = df.query(mean_calculate(acc,year)).UNIT.mean()
#         try:

#             mean = df.query('(ACCOUNT_NO == acc) & (YEAR == year) & (UNIT > 0)').UNIT.mean()
#         except :
#             print('{0} {1} {2}'.format(acc,year, mean))

        return mean
    else:
        return x.UNIT
mean_calculate(12,13)

'(ACCOUNT_NO ==12) & (YEAR ==13) & (UNIT > 0)'

In [11]:
df['IMPUTE_UNIT'] = df.apply( IMPUTE_UNIT_WITH_MEAN, axis=1)

In [12]:
df.IMPUTE_UNIT.lt(0).sum()

0

In [13]:
df.UNIT.lt(1).sum()

78700

In [14]:
df.IMPUTE_UNIT.lt(-1).sum()

0

In [15]:
df.UNIT.lt(-1).sum()

4745

In [16]:
df.to_csv('../baridhara.csv',index=False)